test-gatling/gatling2.txt
GATLING_HOME is set to /home/tai/Bureau/gatling-charts-highcharts-bundle-2.2.2
Simulation about login will begin
Simulation default4.RecordedSimulateloginFalse started...

================================================================================
2016-07-08 17:27:59                                           5s elapsed
---- Admins --------------------------------------------------------------------
[-------------------------------------                                     ]  0%
          waiting: 5      / active: 5      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=11     KO=0     )
> Init                                                     (OK=3      KO=0     )
> Acces api                                                (OK=1      KO=0     )
> Access sync                                              (OK=1      KO=0     )
> presence                                                 (OK=1      KO=0     )
> turnServer                                               (OK=1      KO=0     )
> Login page                                               (OK=1      KO=0     )
> list event                                               (OK=1      KO=0     )
> logo picture                                             (OK=1      KO=0     )
> event                                                    (OK=1      KO=0     )
================================================================================

17:28:01.300 [WARN ] i.g.h.a.ResponseProcessor - Request 'login' failed: status.find.is(200), but actually found 400
testSession(Admins,1,Map(gatling.http.cache.dns -> io.gatling.http.resolver.ShuffleJdkNameResolver@6bbb9fb0, gatling.http.cache.contentCache -> io.gatling.core.util.cache.Cache@6dade034, invite -> @test12:matrix.allmende.io, indice -> 15, login -> test12, password -> test12),1467991675791,4,KO,List(),<function1>)

================================================================================
2016-07-08 17:28:04                                          10s elapsed
---- Admins --------------------------------------------------------------------
[#######-------------------------------------------------------------------] 10%
          waiting: 0      / active: 9      / done:1     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=45     KO=1     )
> Init                                                     (OK=7      KO=0     )
> Acces api                                                (OK=5      KO=0     )
> Access sync                                              (OK=5      KO=0     )
> presence                                                 (OK=5      KO=0     )
> turnServer                                               (OK=5      KO=0     )
> Login page                                               (OK=5      KO=0     )
> list event                                               (OK=5      KO=0     )
> logo picture                                             (OK=4      KO=0     )
> event                                                    (OK=4      KO=0     )
> login                                                    (OK=0      KO=1     )
---- Errors --------------------------------------------------------------------
> status.find.is(200), but actually found 400                         1 (100,0%)
================================================================================

17:28:04.996 [WARN ] i.g.h.a.ResponseProcessor - Request 'login' failed: status.find.is(200), but actually found 400
testSession(Admins,2,Map(gatling.http.cache.dns -> io.gatling.http.resolver.ShuffleJdkNameResolver@5ca173be, gatling.http.cache.contentCache -> io.gatling.core.util.cache.Cache@589efcf2, invite -> @test04:matrix.allmende.io, indice -> 7, login -> test04, password -> test04),1467991676852,1,KO,List(),<function1>)
17:28:05.776 [WARN ] i.g.h.a.ResponseProcessor - Request 'login' failed: status.find.is(200), but actually found 400
testSession(Admins,3,Map(gatling.http.cache.dns -> io.gatling.http.resolver.ShuffleJdkNameResolver@3f07e249, gatling.http.cache.contentCache -> io.gatling.core.util.cache.Cache@3b386171, invite -> @test12:matrix.allmende.io, indice -> 15, login -> test12, password -> test12),1467991677852,1,KO,List(),<function1>)
17:28:06.695 [WARN ] i.g.h.a.ResponseProcessor - Request 'login' failed: status.find.is(200), but actually found 400
testSession(Admins,4,Map(gatling.http.cache.dns -> io.gatling.http.resolver.ShuffleJdkNameResolver@21ee9a92, gatling.http.cache.contentCache -> io.gatling.core.util.cache.Cache@64ec00cb, invite -> @test12:matrix.allmende.io, indice -> 15, login -> test12, password -> test12),1467991678792,0,KO,List(),<function1>)
17:28:08.496 [WARN ] i.g.h.a.ResponseProcessor - Request 'login' failed: status.find.is(200), but actually found 400
testSession(Admins,5,Map(gatling.http.cache.dns -> io.gatling.http.resolver.ShuffleJdkNameResolver@4aa3e07d, gatling.http.cache.contentCache -> io.gatling.core.util.cache.Cache@4e9c7df1, invite -> @test10:matrix.allmende.io, indice -> 13, login -> test10, password -> test10),1467991679792,1,KO,List(),<function1>)
17:28:09.397 [WARN ] i.g.h.a.ResponseProcessor - Request 'login' failed: status.find.is(200), but actually found 400
testSession(Admins,6,Map(gatling.http.cache.dns -> io.gatling.http.resolver.ShuffleJdkNameResolver@3f4d1b7d, gatling.http.cache.contentCache -> io.gatling.core.util.cache.Cache@703c5355, invite -> @test15:matrix.allmende.io, indice -> 18, login -> test15, password -> test15),1467991680792,0,KO,List(),<function1>)
17:28:09.695 [WARN ] i.g.h.a.ResponseProcessor - Request 'login' failed: status.find.is(200), but actually found 400
testSession(Admins,7,Map(gatling.http.cache.dns -> io.gatling.http.resolver.ShuffleJdkNameResolver@5612cce1, gatling.http.cache.contentCache -> io.gatling.core.util.cache.Cache@522d42fb, invite -> @test454:matrix.allmende.io, indice -> 1, login -> test454, password -> test454),1467991681792,0,KO,List(),<function1>)

================================================================================
2016-07-08 17:28:09                                          15s elapsed
---- Admins --------------------------------------------------------------------
[###################################################-----------------------] 70%
          waiting: 0      / active: 3      / done:7     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=89     KO=7     )
> Init                                                     (OK=10     KO=0     )
> Acces api                                                (OK=10     KO=0     )
> Access sync                                              (OK=10     KO=0     )
> presence                                                 (OK=10     KO=0     )
> turnServer                                               (OK=10     KO=0     )
> Login page                                               (OK=10     KO=0     )
> list event                                               (OK=10     KO=0     )
> logo picture                                             (OK=10     KO=0     )
> event                                                    (OK=9      KO=0     )
> login                                                    (OK=0      KO=7     )
---- Errors --------------------------------------------------------------------
> status.find.is(200), but actually found 400                         7 (100,0%)
================================================================================

17:28:09.995 [WARN ] i.g.h.a.ResponseProcessor - Request 'login' failed: status.find.is(200), but actually found 400
testSession(Admins,8,Map(gatling.http.cache.dns -> io.gatling.http.resolver.ShuffleJdkNameResolver@17ea24a8, gatling.http.cache.contentCache -> io.gatling.core.util.cache.Cache@3eac43d0, invite -> @test08:matrix.allmende.io, indice -> 11, login -> test08, password -> test08),1467991682792,0,KO,List(),<function1>)
17:28:10.096 [WARN ] i.g.h.a.ResponseProcessor - Request 'login' failed: status.find.is(200), but actually found 400
testSession(Admins,9,Map(gatling.http.cache.dns -> io.gatling.http.resolver.ShuffleJdkNameResolver@75527145, gatling.http.cache.contentCache -> io.gatling.core.util.cache.Cache@2040c0cd, invite -> @test14:matrix.allmende.io, indice -> 17, login -> test14, password -> test14),1467991683792,0,KO,List(),<function1>)
17:28:10.196 [WARN ] i.g.h.a.ResponseProcessor - Request 'login' failed: status.find.is(200), but actually found 400
testSession(Admins,10,Map(gatling.http.cache.dns -> io.gatling.http.resolver.ShuffleJdkNameResolver@2ccb877a, gatling.http.cache.contentCache -> io.gatling.core.util.cache.Cache@31d877d, invite -> @test14:matrix.allmende.io, indice -> 17, login -> test14, password -> test14),1467991684792,1,KO,List(),<function1>)

================================================================================
2016-07-08 17:28:10                                          15s elapsed
---- Admins --------------------------------------------------------------------
[##########################################################################]100%
          waiting: 0      / active: 0      / done:10    
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=90     KO=10    )
> Init                                                     (OK=10     KO=0     )
> Acces api                                                (OK=10     KO=0     )
> Access sync                                              (OK=10     KO=0     )
> presence                                                 (OK=10     KO=0     )
> turnServer                                               (OK=10     KO=0     )
> Login page                                               (OK=10     KO=0     )
> list event                                               (OK=10     KO=0     )
> logo picture                                             (OK=10     KO=0     )
> event                                                    (OK=10     KO=0     )
> login                                                    (OK=0      KO=10    )
---- Errors --------------------------------------------------------------------
> status.find.is(200), but actually found 400                        10 (100,0%)
================================================================================

Simulation default4.RecordedSimulateloginFalse completed in 14 seconds
Simulation about login is finished
Parsing log file(s)...
Parsing log file(s) done
Generating reports...

================================================================================
---- Global Information --------------------------------------------------------
> request count                                        100 (OK=90     KO=10    )
> min response time                                      1 (OK=1      KO=3     )
> max response time                                     39 (OK=39     KO=6     )
> mean response time                                     9 (OK=10     KO=3     )
> std deviation                                          8 (OK=9      KO=0     )
> response time 50th percentile                          5 (OK=5      KO=4     )
> response time 75th percentile                         19 (OK=20     KO=4     )
> response time 95th percentile                         24 (OK=25     KO=5     )
> response time 99th percentile                         28 (OK=29     KO=5     )
> mean requests/sec                                  6.667 (OK=6      KO=0.667 )
---- Response Time Distribution ------------------------------------------------
> t < 800 ms                                            90 ( 90%)
> 800 ms < t < 1200 ms                                   0 (  0%)
> t > 1200 ms                                            0 (  0%)
> failed                                                10 ( 10%)
---- Errors --------------------------------------------------------------------
> status.find.is(200), but actually found 400                        10 (100,0%)
================================================================================

Reports generated in 0s.
Please open the following file: /home/tai/Bureau/gatling-charts-highcharts-bundle-2.2.2/results/recordedsimulateloginfalse-1467991674830/index.html
Global: max of response time is less than 50 : true
For all requests: count of failed requests is less than 5 : false
Could not find stats matching assertion path List(Login) : false